///Week13-1.cpp step01-1 關於 printf()的格式
///step01-1_有網友問,印出來的數字,要怎麼對齊排版好。
///老師利用一張圖來示範 怎麼使用 printf()的format格式來設定,
///其中%5s 是5格的字串, %5d 是佔5格的整數, %6.2f是佔6格的浮點數,其中小數點後佔2格.zip
#include <stdio.h>
int main()
{
    printf("請輸入座號1~10=>");
    int id;
    scanf("%d", &id);

    printf(" %5s %5s %5s %5s %5s %5s %5s %5s %5s\n",
           "姓名 ","座號","國語","數學","英文","基電","電子","總分","平均成績" );
    printf(" %5s %5d %5d %5d %5d %5d %5d %5d %6.2f\n",
           "名字1",1,  1,  1,  1,  1,  1,  5,   1.0f );
    printf(" %5s %5d %5d %5d %5d %5d %5d %5d %6.2f\n",
           "名字5",5,100,100,100,100,100,500, 100.0f );
}

