///Week10-4.cpp step03-1 篩子法
#include <stdio.h> ///a[ ]是個大表格
int a[10000000]={0, 0, 0, 0};///沒有寫的,都會補0
///外面宣告的變數,可以比較多memory空間
///0:還沒被殺死, 1:被殺死!!!
int main()
{   ///依序去找
    int ans=0;
    for( int i=2; i<10000000; i++ ){
    ///(1)找出沒被殺掉的質數,當國王
        ///a[i] 查查看它有沒有被殺死
        if( a[i]==0 ){///王子i,沒死的王子i
            ans++;///printf("%d ", i); ///會變國王i,
            ///(2)殺光它的兄弟
            for( int k=i+i; k<10000000; k=k+i ) a[k]=1;
        }
    }
    printf("ans: %d", ans);
}
